{
  "Input Excel": "Click 'Add' button to add input file.\nMake sure one Excel file contains only one sheet.",
  "Remove Columns": "Select the columns you wish to remove from the input Excel file.",
  "Average Columns": "Select the columns for which you wish to calculate average.\n\n'Select All Numeric' option can be used to select all the numeric columns automatically. A column is numeric if and only if all it's values are numeric.",
  "Remove If": "Add conditions to remove certain rows from the input Excel.\nEach condition must start from a new line.\nCurrently only '==' operator is supported.\n\nSyntax: <column name>==<some value>\n\nExample:\nClass==I\nClass==II\n\nNote: If 'Remove If' is provided 'Include If' is not allowed and vice versa.",
  "Include If": "Add conditions to include certain rows from the input Excel.\nEach condition must start from a new line.\nCurrently only '==' operator is supported.\n\nSyntax: <column name>==<some value>\n\nExample:\nClass==I\nClass==II\n\nNote: If 'Include If' is provided 'Remove If' is not allowed and vice versa.",
  "Rules": "Here you can add rules to modify input Excel file before generating output Excel.\nCurrently, only Replace rule is supported.\n\nSyntax: <some value>=<some other value>:<column names or indexes>\n\nExample:\nGood=9:2,3,Score\n\nWith this 'Good' will be replaced with number 9. The rule will be applied only on columns 2 and 3 and 'Score'.\nColumns are optional, rule will be applied to all the columns if columns not provided. Both colunm name or index can be provided to specify rule columns.\n\nHow to add a rule to ignore a cell value from average calculation?\nTo ignore the cell value set it equal to 'nan'. For example if you want ignore cells with value 'NA' in column 12 then you should create following rule:\n\nNA=nan:12\n\nNote: Even if you see 'nan' in a cell in column 12, in order to ignore it you will have to add following rule:\n\nnan=nan:12\n\nUsually, empty cells in Excel are loaded as 'nan' so to ignore those we need to add this rule.",
  "Sheets Columns": "Select columns based on which you wish to divide data in to different sheets.\n\nFor example if you choose 'Class' and 'Section' then sheets will be created for each combinations of 'Class' and 'Section' values exisiting in the Excel.",
  "Highlight Columns": "If the value of any cell in any of the selected columns is less than or equal to 7, the corresponding row will be selected."
}